In [1]:
import pandas as pd
import numpy as np

In [2]:
s= ([1,np.nan,'Panda library'])

In [3]:
s1=pd.Series(s)

In [4]:
s1

0                1
1              NaN
2    Panda library
dtype: object

In [11]:
s2 = ([2,np.nan,'b'])

In [12]:
s2 = pd.Series(s2)

In [13]:
s2

0      2
1    NaN
2      b
dtype: object

In [15]:
list1 = ['animal','2','animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

In [16]:
list2 = [3,'c','Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

In [18]:
s6 = pd.Series({'a': 1,
                3: 'python'})
s6

a         1
3    python
dtype: object

In [19]:
df = pd.DataFrame(np.random.randn(6,4))

In [20]:
df

          0         1         2         3
0 -0.250368 -0.029303  0.908093 -0.487154
1 -1.367934 -0.031600 -2.432196 -1.693004
2  0.684877 -1.397006  0.701099 -1.767141
3  0.800548  0.123531  0.998767  0.729413
4  0.014681  0.041619 -0.462424  2.302075
5 -0.711884  1.646218 -1.140037 -0.107280

In [22]:
df1 = pd.DataFrame(np.random.randn(3,3))

In [23]:
df1

          0         1         2
0 -0.206127  1.956232 -0.568627
1 -0.615057  0.319669  0.014541
2 -0.193608  0.375566 -0.392541

In [24]:
df2 = pd.DataFrame({
    'A':1,
    'number':np.array([6]*3,dtype='int32')
})
df2

   A  number
0  1       6
1  1       6
2  1       6

In [25]:
df3 = pd.DataFrame({
    'E':np.array([4]*5,dtype='int'),
    'Day':2
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

In [26]:
df4 = pd.read_csv('annual-enterprise-survey-2019-financial-year-provisional-size-bands-csv.csv')

In [27]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13932 entries, 0 to 13931
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  13932 non-null  int64
 1   industry_code_ANZSIC  13932 non-null  object
 2   industry_name_ANZSIC  13932 non-null  object
 3   rme_size_grp          13932 non-null  object
 4   variable              13932 non-null  object
 5   value                 13932 non-null  object
 6   unit                  13932 non-null  object
dtypes: int64(1), object(6)
memory usage: 762.0+ KB

In [28]:
df4.head()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [29]:
df4.describe()

               year
count  13932.000000
mean    2015.000000
std        2.582082
min     2011.000000
25%     2013.000000
50%     2015.000000
75%     2017.000000
max     2019.000000

In [30]:
df4.columns

Index(['year', 'industry_code_ANZSIC', 'industry_name_ANZSIC', 'rme_size_grp',
       'variable', 'value', 'unit'],
      dtype='object')

In [31]:
df4.dtypes

year                     int64
industry_code_ANZSIC    object
industry_name_ANZSIC    object
rme_size_grp            object
variable                object
value                   object
unit                    object
dtype: object

In [32]:
df4.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
13927    False
13928    False
13929    False
13930    False
13931    False
Length: 13932, dtype: bool

In [33]:
df4.drop_duplicates

<bound method DataFrame.drop_duplicates of        year industry_code_ANZSIC               industry_name_ANZSIC  \
0      2011                    A  Agriculture, Forestry and Fishing
1      2011                    A  Agriculture, Forestry and Fishing
2      2011                    A  Agriculture, Forestry and Fishing
3      2011                    A  Agriculture, Forestry and Fishing
4      2011                    A  Agriculture, Forestry and Fishing
...     ...                  ...                                ...
13927  2019                  all                     All Industries
13928  2019                  all                     All Industries
13929  2019                  all                     All Industries
13930  2019                  all                     All Industries
13931  2019                  all                     All Industries

        rme_size_grp                                         variable  \
0                a_0                                    Activity unit
1                a_0                           Rolling mean employees
2                a_0                          Salaries and wages paid
3                a_0  Sales, government funding, grants and subsidies
4                a_0                                     Total income
...              ...                                              ...
13927  j_Grand_Total                                     Total income
13928  j_Grand_Total                                Total expenditure
13929  j_Grand_Total                      Operating profit before tax
13930  j_Grand_Total                                     Total assets
13931  j_Grand_Total                            Fixed tangible assets

         value               unit
0        46134              COUNT
1            0              COUNT
2          279  DOLLARS(millions)
3         8187  DOLLARS(millions)
4         8866  DOLLARS(millions)
...        ...                ...
13927   728239  DOLLARS(millions)
13928   634710  DOLLARS(millions)
13929    86426  DOLLARS(millions)
13930  2216127  DOLLARS(millions)
13931   535710  DOLLARS(millions)

[13932 rows x 7 columns]>

In [34]:
df4

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
...,...,...,...,...,...,...,...
13927,2019,all,All Industries,j_Grand_Total,Total income,728239,DOLLARS(millions)
13928,2019,all,All Industries,j_Grand_Total,Total expenditure,634710,DOLLARS(millions)
13929,2019,all,All Industries,j_Grand_Total,Operating profit before tax,86426,DOLLARS(millions)
13930,2019,all,All Industries,j_Grand_Total,Total assets,2216127,DOLLARS(millions)
13931,2019,all,All Industries,j_Grand_Total,Fixed tangible assets,535710,DOLLARS(millions)

In [35]:
print(df4.isnull().sum())

year                    0
industry_code_ANZSIC    0
industry_name_ANZSIC    0
rme_size_grp            0
variable                0
value                   0
unit                    0
dtype: int64

In [36]:
df4.dropna()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
...,...,...,...,...,...,...,...
13927,2019,all,All Industries,j_Grand_Total,Total income,728239,DOLLARS(millions)
13928,2019,all,All Industries,j_Grand_Total,Total expenditure,634710,DOLLARS(millions)
13929,2019,all,All Industries,j_Grand_Total,Operating profit before tax,86426,DOLLARS(millions)
13930,2019,all,All Industries,j_Grand_Total,Total assets,2216127,DOLLARS(millions)
13931,2019,all,All Industries,j_Grand_Total,Fixed tangible assets,535710,DOLLARS(millions)

In [39]:
df8 = pd.DataFrame(np.random.randn(6,4))

In [40]:
df8

          0         1         2         3
0  0.969641  1.547034  0.093780 -0.618537
1 -0.464447 -0.001196  0.630050  1.259260
2 -2.173897  1.081013  0.598996  1.201537
3  0.506749  0.875481  0.563018 -1.582573
4 -1.003626  0.148544 -0.737042 -0.170429
5  0.617570 -0.506334 -0.335043 -0.063367

In [41]:
df8.mean()

0   -0.258002
1    0.524090
2    0.135627
3    0.004315
dtype: float64

In [42]:
df8.apply(np.cumsum)

          0         1         2         3
0  0.969641  1.547034  0.093780 -0.618537
1  0.505195  1.545838  0.723830  0.640723
2 -1.668703  2.626850  1.322826  1.842260
3 -1.161954  3.502332  1.885844  0.259687
4 -2.165580  3.650876  1.148802  0.089258
5 -1.548010  3.144542  0.813760  0.025891

In [43]:
s7 = np.array(['animal','bird','Pandas Library'])
s7 = pd.Series(s7)
s7

0            animal
1              bird
2    Pandas Library
dtype: object

In [44]:
s7.str.lower()

0            animal
1              bird
2    pandas library
dtype: object

In [45]:
s7.str.upper()

0            ANIMAL
1              BIRD
2    PANDAS LIBRARY
dtype: object

In [46]:
s7.str.swapcase()

0            ANIMAL
1              BIRD
2    pANDAS lIBRARY
dtype: object

In [47]:
s7.str.len()

0     6
1     4
2    14
dtype: int64

In [48]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

In [49]:
s7.unique()

array(['animal', 'bird', 'Pandas Library'], dtype=object)

In [50]:
repeat_list = [2,3,2]
s7.str.repeat(repeat_list)

0                    animalanimal
1                    birdbirdbird
2    Pandas LibraryPandas Library
dtype: object

In [51]:
st = "abc de "

In [53]:
len(st)

7